Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicTagAttributes Constructor
Overload List
Name | Description
ViewMarkBasicTagAttributes()
 Creates a new mark tag attributes instance.
ViewMarkBasicTagAttributes(Vector, TagLocation, ContainerElement)
 Creates a new mark tag attributes instance with the given offset, location and content.
Top
See Also
Reference
ViewMarkBasicTagAttributes Class
Tekla.Structures.Drawing Namespace